Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: །གལ་ཏེ་གཟུགས་རྟག་ཅེས་བྱ་བ་འམ། མི་རྟག་ཅེས་བྱ་བར་མི་སྤྱོད་ན། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་དོ།
en: II-III: 171} “If they do not engage with the notions that physical forms are permanent or impermanent, then they are practicing the perfection of wisdom.

source: །གལ་ཏེ་ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་རྟག་ཅེས་བྱ་བ་འམ། མི་རྟག་ཅེས་བྱ་བར་མི་སྤྱོད་ན། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་དོ།
en: If they do not engage with the notions that feelings, perceptions, formative predispositions, and consciousness are permanent or impermanent, then they are practicing the perfection of wisdom.

source: །གལ་ཏེ་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་དུ་རྟག་ཅེས་བྱ་བ་འམ། མི་རྟག་ཅེས་བྱ་བར་མི་སྤྱོད་ན། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་དོ།
en: If they do not engage with the notions that [all phenomena, attributes, and goals], up to and including all-aspect omniscience, are permanent or impermanent, then they are practicing the perfection of wisdom. “

source: །གལ་ཏེ་གཟུགས་བདེ་ཞེས་བྱ་བའམ། སྡུག་བསྔལ་ཞེས་བྱ་བར་མི་སྤྱོད་ན། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་དོ།
en: If they do not engage with the notions that physical forms are imbued with happiness or imbued with suffering, then they are practicing the perfection of wisdom.

source: །གལ་ཏེ་ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་བདེ་ཞེས་བྱ་བའམ། སྡུག་བསྔལ་ཞེས་བྱ་བར་མི་སྤྱོད་ན། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་དོ།
en: If they do not engage with the notions that feelings, perceptions, formative predispositions, and consciousness are imbued with happiness or imbued with suffering, then they are practicing the perfection of wisdom.

source: །གལ་ཏེ་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་དུ་བདེ་ཞེས་བྱ་བ་འམ། སྡུག་བསྔལ་ཞེས་བྱ་བར་མི་སྤྱོད་ན། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་དོ།
en: If they do not engage with the notions that [all phenomena, attributes, and goals], up to and including all-aspect omniscience, are imbued with happiness or imbued with suffering, then they are practicing the perfection of wisdom. “

source: །གལ་ཏེ་གཟུགས་བདག་ཅེས་བྱ་བ་འམ། བདག་མེད་ཅེས་བྱ་བར་མི་སྤྱོད་ན། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་དོ།
en: If they do not engage with the notions that physical forms constitute a self or a nonself, then they are practicing the perfection of wisdom.

source: །གལ་ཏེ་ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་རྣམ་པར་ཤེས་པ་བདག་ཅེས་བྱ་བའམ། བདག་མེད་ཅེས་བྱ་བར་མི་སྤྱོད་ན། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་དོ།
en: If they do not engage with the notions that feelings, perceptions, formative predispositions, and consciousness constitute a self or a nonself, then they are practicing the perfection of wisdom.

source: །གལ་ཏེ་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་དུ་བདག་ཅེས་བྱ་བ་འམ། བདག་མེད་ཅེས་བྱ་བར་མི་སྤྱོད་ན། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་དོ།
en: If they do not engage with the notions that [all phenomena, attributes, and goals], up to and including all-aspect omniscience, constitute a self or a nonself, then they are practicing the perfection of wisdom. “

source: །གལ་ཏེ་གཟུགས་སྡུག་ཅེས་བྱ་བ་འམ། མི་སྡུག་ཅེས་བྱ་བར་མི་སྤྱོད་ན། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་དོ།
en: If they do not engage with the notions that physical forms are pleasant or unpleasant, then they are practicing the perfection of wisdom.

source: །གལ་ཏེ་ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་སྡུག་ཅེས་བྱ་བ་འམ། མི་སྡུག་ཅེས་བྱ་བར་མི་སྤྱོད་ན། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་དོ།
en: If they do not engage with the notions that feelings, perceptions, formative predispositions, and consciousness are pleasant or unpleasant, then they are practicing the perfection of wisdom.

source: །གལ་ཏེ་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་དུ་སྡུག་ཅེས་བྱ་བ་འམ། མི་སྡུག་ཅེས་བྱ་བར་མི་སྤྱོད་ན། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་དོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: If they do not engage with the notions that [all phenomena, attributes, and goals], up to and including all-aspect omniscience, are pleasant or unpleasant, then they are practicing the perfection of wisdom.

source: གང་རྟག་པའམ་མི་རྟག་པའམ། བདེ་བ་འམ་སྡུག་བསྔལ་བའམ། བདག་གམ་བདག་མེད་པ་འམ། སྡུག་པ་འམ་མི་སྡུག་པར་འགྱུར་བ་དེ་ལྟ་བུའི་གཟུགས་མེད་དོ། །གང་རྟག་པའམ།
en: If you ask why, that which is permanent or impermanent, that which is imbued with happiness or imbued with suffering, that which constitutes a self or a nonself, and that which is pleasant or unpleasant is not physical forms.

source: མི་རྟག་པའམ་བདེ་བའམ། སྡུག་བསྔལ་བའམ། བདག་གམ། བདག་མེད་པའམ། སྡུག་པ་འམ། མི་སྡུག་པར་འགྱུར་བ་དེ་ལྟ་བུའི་ཚོར་བ་དང་འདུ་ཤེས་དང་།
en: That which is permanent or impermanent, that which is imbued with happiness or imbued with suffering, that which constitutes a self or a nonself, and that which is pleasant or unpleasant is not feelings, perceptions, formative predispositions, or consciousness.

source: འདུ་བྱེད་དང་རྣམ་པར་ཤེས་པ་མེད་དོ། །གང་རྟག་པའམ་མི་རྟག་པའམ། བདེ་བ་འམ་སྡུག་བསྔལ་བའམ། བདག་གམ་བདག་མེད་པའམ། སྡུག་པའམ་མི་སྡུག་པར་འགྱུར་བ་དེ་ལྟ་བུའི་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་དུ་མེད་དོ།། །།
en: That which is permanent or impermanent, that which is imbued with happiness or imbued with suffering, that which constitutes a self or a nonself, and that which is pleasant or unpleasant is not [all phenomena, attributes, and goals], up to and including all-aspect omniscience. “

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟོང་ཕྲག་ཉི་ཤུ་ལྔ་པ། བམ་པོ་བཞི་བཅུ་པ། རབ་འབྱོར་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། གལ་ཏེ་གཟུགས་ཡོངས་སུ་མ་རྫོགས་སོ་ཞེས་བྱ་བར་མི་སྤྱོད་ན། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་དོ།
en: Moreover, Subhūti, when bodhisattva great beings practice the perfection of wisdom, if they do not engage with the notion that physical forms are unperfected, then they are practicing the perfection of wisdom.

source: །ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་ཡོངས་སུ་མ་རྫོགས་སོ་ཞེས་བྱ་བར་མི་སྤྱོད་ན། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་དོ།
en: If they do not engage with the notion that feelings, perceptions, formative predispositions, and consciousness are unperfected, then they are practicing the perfection of wisdom.

source: །གལ་ཏེ་སྐྱེ་མཆེད་དང་ཁམས་དང་རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་ཡོངས་སུ་མ་རྫོགས་སོ་ཞེས་བྱ་བར་མི་སྤྱོད་ན། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་དོ། །ཕ་རོལ་དུ་ཕྱིན་པ་ཐམས་ཅད་དང་།
en: If they do not engage with the notion that the sense fields, the sensory elements, and the links of dependent origination are unperfected, then they are practicing the perfection of wisdom.

source: སྟོང་པ་ཉིད་ཐམས་ཅད་ཡོངས་སུ་མ་རྫོགས་སོ་ཞེས་བྱ་བར་མི་སྤྱོད་ན། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་དོ།
en: If they do not engage with the notion that {Ki.II-III: 172} all the perfections and all the aspects of emptiness are unperfected, then then they are practicing the perfection of wisdom.

source: །དྲན་པ་ཉེ་བར་གཞག་པ་རྣམས་ཡོངས་སུ་མ་རྫོགས་སོ་ཞེས་བྱ་བར་མི་སྤྱོད་ན། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་དོ། །ཡང་དག་པར་སྤོང་བ་རྣམས་དང་།
en: If they do not engage with the notion that the applications of mindfulness are unperfected, then they are practicing the perfection of wisdom.

source: རྫུ་འཕྲུལ་གྱི་རྐང་པ་རྣམས་དང་། དབང་པོ་རྣམས་དང་། སྟོབས་རྣམས་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་རྣམས་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་ཡོངས་སུ་མ་རྫོགས་སོ་ཞེས་བྱ་བར་མི་སྤྱོད་ན། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་དོ། །འཕགས་པའི་བདེན་པ་རྣམས་དང་། བསམ་གཏན་རྣམས་དང་། ཚད་མེད་པ་རྣམས་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་དང་། རྣམ་པར་ཐར་པ་བརྒྱད་དང་།
en: If they do not engage with the notion that the correct exertions, the supports for miraculous ability, the faculties, the powers, the branches of enlightenment, and the noble eightfold path are unperfected, then they are practicing the perfection of wisdom.

source: མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པར་དགུ་དང་། སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་རྣམས་ཡོངས་སུ་མ་རྫོགས་སོ་ཞེས་བྱ་བར་མི་སྤྱོད་ན།
en: If they do not engage with the notion that the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the eight aspects of liberation, the nine serial steps of meditative absorption, emptiness, signlessness, wishlessness, and the extrasensory powers are unperfected, then they are practicing the perfection of wisdom.

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་དོ། །གལ་ཏེ་ཏིང་ངེ་འཛིན་རྣམས་དང་། གཟུངས་ཀྱི་སྒོ་རྣམས་ཡོངས་སུ་མ་རྫོགས་སོ་ཞེས་བྱ་བར་མི་སྤྱོད་ན། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་དོ།
en: If they do not engage with the notion that the meditative stabilities and the dhāraṇī gateways are unperfected, then they are practicing the perfection of wisdom.

source: །གལ་ཏེ་དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ཡོངས་སུ་མ་རྫོགས་སོ་ཞེས་བྱ་བར་མི་སྤྱོད་ན།
en: If they do not engage with the notion that the ten powers of the tathāgatas, the four fearlessnesses, the four kinds of exact knowledge, great loving kindness, great compassion, and the eighteen distinct qualities of the buddhas are unperfected, then they are practicing the perfection of wisdom.

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་དོ། །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་དུ་ཡོངས་སུ་མ་རྫོགས་སོ་ཞེས་བྱ་བར་མི་སྤྱོད་ན། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་དོ།
en: If they do not engage with the notion that [the goals], up to and including all-aspect omniscience, are unperfected, then they are practicing the perfection of wisdom. “

source: གཟུགས་ཡོངས་སུ་མ་རྫོགས་པ་གང་ཡིན་པ་དེ་གཟུགས་མ་ཡིན་ནོ་ཞེས་བྱ་བར་དེ་ལྟར་ཡང་མི་སྤྱོད་ན། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་དོ།
en: If indeed they do not engage in that manner with the notion that unperfected physical forms are not physical forms, then they are practicing the perfection of wisdom.

source: །ཚོར་བ་དང་འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་ཡོངས་སུ་མ་རྫོགས་པ་གང་ཡིན་པ་དེ་རྣམ་པར་ཤེས་པ་མ་ཡིན་ནོ་ཞེས་བྱ་བ་དེ་ལྟར་ཡང་མི་སྤྱོད་ན། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་དོ།
en: If indeed they do not engage in that manner with the notion that unperfected feelings, perceptions, formative predispositions, and consciousness are not consciousness [and so forth], then they are practicing the perfection of wisdom.

source: །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་དུ་ཡོངས་སུ་མ་རྫོགས་པ་གང་ཡིན་པ་དེ་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་མ་ཡིན་ནོ་ཞེས་བྱ་བར་དེ་ལྟར་ཡང་མི་སྤྱོད་ན། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་དོ།
en: If indeed they do not engage in that manner with the notion that unperfected [phenomena, attributes, and goals], up to and including all-aspect omniscience, are not all-aspect omniscience [and so forth], then they are practicing the perfection of wisdom.” “

source: །གསོལ་པ། བཅོམ་ལྡན་འདས་དེ་ལྟར་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱིས། བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་པའི་རིགས་ཀྱི་བུ་དང་རིགས་ཀྱི་བུ་མོ་རྣམས་ལ་ཆགས་པ་དང་མ་ཆགས་པ་ལེགས་པར་བསྟན་པ་འདི་ངོ་མཚར་ཏོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Blessed Lord, how wonderful it is that this exegesis on the attachment and nonattachment possessed by noble sons and noble daughters who espouse the vehicle of the bodhisattvas has been eloquently explained by the tathāgata, arhat, completely awakened Buddha!” “

source: དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱིས། བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་པའི་རིགས་ཀྱི་བུ་དང་རིགས་ཀྱི་བུ་མོ་རྣམས་ལ་ཆགས་པ་དང་། མ་ཆགས་པ་ལེགས་པར་བསྟན་ཏོ།
en: The attachment and nonattachment possessed by noble sons and noble daughters who espouse the vehicle of the bodhisattvas have been eloquently explained by the tathāgata, arhat, completely awakened Buddha. “

source: །རབ་འབྱོར་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། གལ་ཏེ་གཟུགས་ཆགས་པ་འམ་མ་ཆགས་པ་ཞེས་བྱ་བར་མི་སྤྱོད་ན། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་དོ། །ཚོར་བ་དང་།
en: Moreover, Subhūti, when bodhisattva great beings practice the perfection of wisdom, if they do not engage with the notions that physical forms are with attachment, or that they are without attachment, then they are practicing the perfection of wisdom.

source: འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་ཆགས་པའམ། མ་ཆགས་པ་ཞེས་བྱ་བར་མི་སྤྱོད་ན། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་དོ།
en: If they do not engage with the notions that feelings, perceptions, formative predispositions, and consciousness are with attachment, or that they are without attachment, then they are practicing the perfection of wisdom.

source: །གལ་ཏེ་སྐྱེ་མཆེད་དང་ཁམས་དང་། རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བ་ཆགས་པའམ། མ་ཆགས་པ་ཞེས་བྱ་བར་མི་སྤྱོད་ན། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་དོ།
en: If they do not engage with the notions that the sense fields, the sensory elements, and the links of dependent origination are with attachment, or that they are without attachment, then they are practicing the perfection of wisdom.

source: །སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ཆགས་པའམ། མ་ཆགས་པ་ཞེས་བྱ་བར་མི་སྤྱོད་ན། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་དོ།
en: If they do not engage with the notions that the perfection of generosity is with attachment, or that it is without attachment, then they are practicing the perfection of wisdom.

source: །ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་ཆགས་པའམ།
en: If they do not engage with the notions that the perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, and the perfection of wisdom are with attachment, or that they are without attachment, then they are practicing the perfection of wisdom.

source: མ་ཆགས་པ་ཞེས་བྱ་བར་མི་སྤྱོད་ན། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་དོ། །ནང་སྟོང་པ་ཉིད་ཆགས་པའམ།
en: If they do not engage with the notions that the emptiness of internal phenomena is with attachment, or that it is without attachment, then they are practicing the perfection of wisdom.

source: མ་ཆགས་པ་ཞེས་བྱ་བར་མི་སྤྱོད་ན། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་དོ། །དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་དུ་ཆགས་པའམ། མ་ཆགས་པ་ཞེས་བྱ་བར་མི་སྤྱོད་ན། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་དོ།
en: If they do not engage with the notions that [the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities, are with attachment, or that they are without attachment, then they are practicing the perfection of wisdom.

source: །བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་ཆགས་པའམ། མ་ཆགས་པ་ཞེས་བྱ་བར་མི་སྤྱོད་ན། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་དོ། །འཕགས་པའི་བདེན་པ་རྣམས་དང་། བསམ་གཏན་རྣམས་དང་། ཚད་མེད་པ་རྣམས་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་དང་།
en: If they do not engage with the notions that the thirty-seven factors conducive to enlightenment are with attachment, or that they are without attachment, then they are practicing the perfection of wisdom.

source: རྣམ་པར་ཐར་པ་བརྒྱད་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། སྟོང་པ་ཉིད་དང་མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་རྣམས་ཆགས་པ་འམ་མ་ཆགས་པ་ཞེས་བྱ་བར་མི་སྤྱོད་ན།
en: If they do not engage with the notions that the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the eight aspects of liberation, the nine serial steps of meditative absorption, emptiness, signlessness, wishlessness, and the extrasensory powers are with attachment, or that they are without attachment, then they are practicing the perfection of wisdom.

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་དོ། །ཏིང་ངེ་འཛིན་རྣམས་དང་གཟུངས་ཀྱི་སྒོ་རྣམས་ཆགས་པའམ། མ་ཆགས་པ་ཞེས་བྱ་བར་མི་སྤྱོད་ན། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་དོ། །དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་།
en: If they do not engage with the notions that the meditative stabilities and the dhāraṇī gateways are with attachment, or that they are without attachment, then they are practicing the perfection of wisdom.

source: མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ཆགས་པའམ་མ་ཆགས་པ་ཞེས་བྱ་བར་མི་སྤྱོད་ན།
en: If they do not engage with the notions that the ten powers of the tathāgatas, the four fearlessnesses, the four kinds of exact knowledge, great loving kindness, great compassion, and the eighteen distinct qualities of the buddhas are with attachment, or that they are without attachment, then they are practicing the perfection of wisdom.

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་དོ། །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་དུ་ཆགས་པའམ། མ་ཆགས་པ་ཞེས་བྱ་བར་མི་སྤྱོད་ན།
en: If they do not engage with the notions that [the goals], up to and including all-aspect omniscience, are with attachment, or that they are without attachment, then they are practicing the perfection of wisdom. {

source: །རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་ལྟར་སྤྱོད་ན། གཟུགས་ཆགས་པའམ། མ་ཆགས་པ་ཞེས་བྱ་བར་འདུ་ཤེས་པ་མེད་དོ།
en: II-III: 173} “Subhūti, if bodhisattva great beings practice in that manner, they do not perceive that physical forms are with attachment, or that they are without attachment.

source: །ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་ཆགས་པའམ། མ་ཆགས་པ་ཞེས་བྱ་བར་འདུ་ཤེས་པ་མེད་དོ།
en: They do not perceive that feelings, perceptions, formative predispositions, and consciousness are with attachment, or that they are without attachment.

source: །སྐྱེ་མཆེད་དང་ཁམས་དང་། རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བ་ཆགས་པའམ། མ་ཆགས་པ་ཞེས་བྱ་བར་འདུ་ཤེས་པ་མེད་དོ།
en: They do not perceive that the sense fields, the sensory elements, and the links of dependent origination are with attachment, or that they are without attachment.

source: །ཕ་རོལ་དུ་ཕྱིན་པ་ཐམས་ཅད་དང་། སྟོང་པ་ཉིད་ཐམས་ཅད་དང་། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་ཆགས་པའམ། མ་ཆགས་པ་ཞེས་བྱ་བར་འདུ་ཤེས་པ་མེད་དོ། །འཕགས་པའི་བདེན་པ་རྣམས་དང་། བསམ་གཏན་རྣམས་དང་། ཚད་མེད་པ་རྣམས་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་དང་།
en: They do not perceive that all the perfections, all the aspects of emptiness, and the thirty-seven factors conducive to enlightenment are with attachment, or that they are without attachment.

source: རྣམ་པར་ཐར་པ་བརྒྱད་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། སྟོང་པ་ཉིད་དང་མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་རྣམས་ཆགས་པའམ།
en: They do not perceive that the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the eight aspects of liberation, the nine serial steps of meditative absorption, emptiness, signlessness, wishlessness, and the extrasensory powers are with attachment, or that they are without attachment.

source: མ་ཆགས་པ་ཞེས་བྱ་བར་འདུ་ཤེས་པ་མེད་དོ། །ཏིང་ངེ་འཛིན་རྣམས་དང་། གཟུངས་ཀྱི་སྒོ་རྣམས་ཆགས་པའམ། མ་ཆགས་པ་ཞེས་བྱ་བར་འདུ་ཤེས་པ་མེད་དོ།
en: They do not perceive that the meditative stabilities and the dhāraṇī gateways are with attachment, or that they are without attachment.

source: །དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ཆགས་པའམ།
en: They do not perceive that the ten powers of the tathāgatas, the four fearlessnesses, the four kinds of exact knowledge, great loving kindness, great compassion, and the eighteen distinct qualities of the buddhas are with attachment, or that they are without attachment.

source: མ་ཆགས་པ་ཞེས་བྱ་བར་འདུ་ཤེས་པ་མེད་དོ། །རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་ཆགས་པའམ། མ་ཆགས་པ་ཞེས་བྱ་བར་འདུ་ཤེས་པ་མེད་དོ།
en: They do not perceive that the fruit of entering the stream to nirvāṇa is with attachment, or that it is without attachment.

source: །ལན་ཅིག་ཕྱིར་འོང་བའི་འབྲས་བུ་དང་། ཕྱིར་མི་འོང་བའི་འབྲས་བུ་དང་། དགྲ་བཅོམ་པ་ཉིད་ཆགས་པའམ། མ་ཆགས་པ་ཞེས་བྱ་བར་འདུ་ཤེས་པ་མེད་དོ།
en: They do not perceive that the fruit of being destined for only one more rebirth, the fruit of no longer being subject to rebirth, and arhatship are with attachment, or that they are without attachment.

source: །རང་བྱང་ཆུབ་ཆགས་པའམ། མ་ཆགས་པ་ཞེས་བྱ་བར་འདུ་ཤེས་པ་མེད་དོ།
en: They do not perceive that individual enlightenment is with attachment, or that it is without attachment.

source: །བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཆགས་པའམ། མ་ཆགས་པ་ཞེས་བྱ་བར་འདུ་ཤེས་པ་མེད་དོ།
en: They do not perceive that unsurpassed, complete enlightenment is with attachment, or that it is without attachment.” “

source: །གསོལ་པ་བཅོམ་ལྡན་འདས་དེ་ལྟར་ཆོས་ཟབ་མོ་འདི་བསྟན་ཀྱང་ཡོངས་སུ་མི་འགྲིབ། མ་བསྟན་ཀྱང་ཡོངས་སུ་མི་འགྲིབ།
en: Blessed Lord, how most wonderful it is that this profound Dharma is neither diminished when it is explained, nor is it diminished even when it is not explained.

source: བསྟན་ཀྱང་མི་འཕེལ། མ་བསྟན་ཀྱང་མི་འཕེལ་བ་ངོ་མཚར་ཆེའོ།
en: It is neither enhanced when it is explained, nor is it enhanced even when it is not explained!” “

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། དེ་དེ་བཞིན་ནོ། །རབ་འབྱོར་དེ་དེ་བཞིན་ཏེ།
en: It is so, Subhūti! It is so!” replied the Blessed One. “

source: ཆོས་ཟབ་མོ་འདི་བསྟན་ཀྱང་ཡོངས་སུ་མི་འགྲིབ། མ་བསྟན་ཀྱང་ཡོངས་སུ་མི་འགྲིབ།
en: This profound Dharma is neither diminished when it is explained, nor is it diminished even when it is not explained.

source: བསྟན་ཀྱང་མི་འཕེལ་མ་བསྟན་ཀྱང་མི་འཕེལ་ལོ།
en: It is neither enhanced when it is explained, nor is it enhanced even when it is not explained.

source: །རབ་འབྱོར་འདི་ལྟ་སྟེ་དཔེར་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ནམ་འཚོའི་བར་དུ་བཞུགས་ཤིང་། ནམ་མཁའི་ལེགས་པའམ། མ་ལེགས་པ་བརྗོད་ཀྱང་།
en: Subhūti, this is just as if the tathāgatas, arhats, completely awakened buddhas were to eulogize or not eulogize space for the duration of their entire lives.

source: ནམ་མཁའ་ནི་ལེགས་པ་བརྗོད་པས་ཡོངས་སུ་འཕེལ་བ་མེད་དོ། །ཉེས་པ་བརྗོད་པས་ཡོངས་སུ་འགྲིབ་པ་མེད་དོ།
en: Space would neither be enhanced when it is eulogized, nor would it be diminished when it is disparaged.

source: །ནམ་མཁའ་ནི་ལེགས་པ་བརྗོད་ཀྱང་ཆགས་པར་འགྱུར་བ་འཕེལ་བ་མེད་དོ། །ཉེས་པ་བརྗོད་ཀྱང་ཁོང་ཁྲོ་བར་འགྱུར་བ་མེད་དོ། རབ་འབྱོར་འདི་ལྟ་སྟེ་དཔེར་ན།
en: Space does not become attached even when it is eulogized, and space does not become annoyed even when it is disparaged.

source: སྒྱུ་མའི་སྐྱེས་བུ་ནི་ལེགས་པ་བརྗོད་ཀྱང་འཕེལ་བ་མེད་དོ། །ཉེས་པ་བརྗོད་ཀྱང་ཡོངས་སུ་འགྲིབ་པ་མེད་དོ། །ལེགས་པ་བརྗོད་ཀྱང་ཆགས་པར་འགྱུར་བ་མེད་དོ། །ཉེས་པ་བརྗོད་ཀྱང་ཁོང་ཁྲོ་བར་འགྱུར་བ་མེད་དོ། །རབ་འབྱོར་དེ་བཞིན་དུ་ཆོས་རྣམས་ཀྱི་ཆོས་ཉིད་གང་ཡིན་པ་དེ་བསྟན་ཀྱང་དེ་བཞིན།
en: Subhūti, just as an illusory man is neither enhanced when eulogized, nor diminished when disparaged, in the same way, Subhūti, the reality of phenomena is such even when it is explained, and it is such even when it is not explained.” “

source: མ་བསྟན་ཀྱང་དེ་བཞིན་ནོ། །གསོལ་པ། བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་ཅིང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་བསྟན་པའི་ཚེ་ཞུམ་པ་དང་། གཡེང་བར་མི་འགྱུར་བ་དང་།
en: Blessed Lord, when bodhisattva great beings practice the perfection of wisdom and teach the perfection of wisdom, they are neither disheartened nor distracted.

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ལ་བརྩོན་པར་བགྱིད་ཅིང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པ་ནི་དཀའ་བ་བགྱིད་པའོ།
en: Persevering in this perfection of wisdom, they do not turn away from unsurpassed, complete enlightenment, but achieve that which is difficult.

source: །དེ་ཅིའི་སླད་དུ་ཞེ་ན། བཅོམ་ལྡན་འདས་འདི་ལྟ་སྟེ། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་བསྒོམ་པ་འདི་ནི་ནམ་མཁའ་བསྒོམ་པ་སྟེ།
en: If one were to ask why, Blessed Lord, it is because this cultivation of the perfection of wisdom by bodhisattva great beings is like cultivating space.

source: ནམ་མཁའ་ལ་ནི་གཟུགས་མ་མཆིས་སོ། །ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་།
en: That is to say, in space, physical forms are not discerned; nor are feelings, perceptions, {Ki.

source: རྣམ་པར་ཤེས་པ་མ་མཆིས་སོ།
en: II-III: 174} formative predispositions, and consciousness discerned.

source: །ནམ་མཁའ་ལ་ནི་སྐྱེ་མཆེད་དང་། ཁམས་དང་། རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་མ་མཆིས་སོ།
en: In space, the sense fields, the sensory elements, and the links of dependent origination are not discerned.
